import React from 'react';

const Section6 = () => {
  return (
    <section className="section section_6" id="section_6">
      <div className="card">
        <div className="left_wrap">
          <h2>ニュース</h2>
          <p>最新のブレイクスルー、パートナーシップ、メディア掲載、持続可能性のマイルストーンなど、すべての情報を一箇所でご確認いただけます。</p>
          <a href="/news" className="btn pill_btn_darkgreen">
            すべてのニュースを読む
            <svg viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M6.62611 13.3752C3.10104 13.3752 0.250977 10.5251 0.250977 7.00007C0.250977 3.47499 3.10104 0.624931 6.62611 0.624931C10.1512 0.624931 13.0012 3.47499 13.0012 7.00007C13.0012 10.5251 10.1512 13.3752 6.62611 13.3752ZM6.62611 1.37495C3.51354 1.37495 1.00099 3.8875 1.00099 7.00007C1.00099 10.1126 3.51354 12.6252 6.62611 12.6252C9.73868 12.6252 12.2512 10.1126 12.2512 7.00007C12.2512 3.8875 9.73868 1.37495 6.62611 1.37495Z" />
              <path d="M6.51378 10.6373L5.98877 10.1122L9.10134 6.99968L5.98877 3.88712L6.51378 3.36211L10.1514 6.99968L6.51378 10.6373Z" />
              <path d="M3.25098 6.6249H9.62611V7.37492H3.25098V6.6249Z" />
            </svg>
          </a>
        </div>
        <div className="right_wrap">
          <div className="text_content">
            <span className="date">2025年3月25日</span>
            <span className="category">ニュース</span>
            <p>リラクゼーションスタジオ「Re.Ra.Ku」でのナチュラルアルジーシリカパウダーのサンプリングキャンペーン</p>
            <a href="/news/news-1" className="btn pill_btn_darkgreen">
              続きを読む
              <svg viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M6.62611 13.3752C3.10104 13.3752 0.250977 10.5251 0.250977 7.00007C0.250977 3.47499 3.10104 0.624931 6.62611 0.624931C10.1512 0.624931 13.0012 3.47499 13.0012 7.00007C13.0012 10.5251 10.1512 13.3752 6.62611 13.3752ZM6.62611 1.37495C3.51354 1.37495 1.00099 3.8875 1.00099 7.00007C1.00099 10.1126 3.51354 12.6252 6.62611 12.6252C9.73868 12.6252 12.2512 10.1126 12.2512 7.00007C12.2512 3.8875 9.73868 1.37495 6.62611 1.37495Z" />
                <path d="M6.51378 10.6373L5.98877 10.1122L9.10134 6.99968L5.98877 3.88712L6.51378 3.36211L10.1514 6.99968L6.51378 10.6373Z" />
                <path d="M3.25098 6.6249H9.62611V7.37492H3.25098V6.6249Z" />
              </svg>
            </a>
          </div>
          <div className="text_content">
            <span className="date">2025年2月15日</span>
            <span className="category">ニュース</span>
            <p>私たちのコスメブランド「Terra+」が2月22日（土）JJマガジンのスペシャルイベントに参加！</p>
            <a href="/news/news-2" className="btn pill_btn_darkgreen">
              続きを読む
              <svg viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M6.62611 13.3752C3.10104 13.3752 0.250977 10.5251 0.250977 7.00007C0.250977 3.47499 3.10104 0.624931 6.62611 0.624931C10.1512 0.624931 13.0012 3.47499 13.0012 7.00007C13.0012 10.5251 10.1512 13.3752 6.62611 13.3752ZM6.62611 1.37495C3.51354 1.37495 1.00099 3.8875 1.00099 7.00007C1.00099 10.1126 3.51354 12.6252 6.62611 12.6252C9.73868 12.6252 12.2512 10.1126 12.2512 7.00007C12.2512 3.8875 9.73868 1.37495 6.62611 1.37495Z" />
                <path d="M6.51378 10.6373L5.98877 10.1122L9.10134 6.99968L5.98877 3.88712L6.51378 3.36211L10.1514 6.99968L6.51378 10.6373Z" />
                <path d="M3.25098 6.6249H9.62611V7.37492H3.25098V6.6249Z" />
              </svg>
            </a>
          </div>
          <div className="text_content">
            <span className="date">2025年2月14日</span>
            <span className="category">ニュース</span>
            <p>TORIKAI CAFEとTerra+が機能性スイーツ開発で業務提携</p>
            <a href="/news/news-3" className="btn pill_btn_darkgreen">
              続きを読む
              <svg viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M6.62611 13.3752C3.10104 13.3752 0.250977 10.5251 0.250977 7.00007C0.250977 3.47499 3.10104 0.624931 6.62611 0.624931C10.1512 0.624931 13.0012 3.47499 13.0012 7.00007C13.0012 10.5251 10.1512 13.3752 6.62611 13.3752ZM6.62611 1.37495C3.51354 1.37495 1.00099 3.8875 1.00099 7.00007C1.00099 10.1126 3.51354 12.6252 6.62611 12.6252C9.73868 12.6252 12.2512 10.1126 12.2512 7.00007C12.2512 3.8875 9.73868 1.37495 6.62611 1.37495Z" />
                <path d="M6.51378 10.6373L5.98877 10.1122L9.10134 6.99968L5.98877 3.88712L6.51378 3.36211L10.1514 6.99968L6.51378 10.6373Z" />
                <path d="M3.25098 6.6249H9.62611V7.37492H3.25098V6.6249Z" />
              </svg>
            </a>
          </div>
        </div>
      </div>
    </section>
  );
};

export default Section6;
