import React from 'react';

const Section4 = () => {
  return (
    <section className="section section_4" id="section_4">
      <div className="card">
        <h2>マザーベジタブルとは？</h2>
        <h5>育てば育つほど、あなたと地球が満たされる。</h5>
        <p>マザーベジタブルは、食品、美容、そして環境をサポートする未来の恵みです。あるものは食べ物となり、あるものは美しさを高め、あるものは空気を浄化して地球を癒します。人々と地球を化学物質から解放し、有機の恵みで健康を育み、CO₂削減に貢献します。30億年間その姿を保ち続け、すべての生命の起源である「地球誕生の時からの植物」が、これからの私たちの生き方を変えていきます。</p>
        <button type="button" className="btn more_details_btn">
          詳細はこちらをクリック
          <svg viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M6.62611 13.3752C3.10104 13.3752 0.250977 10.5251 0.250977 7.00007C0.250977 3.47499 3.10104 0.624931 6.62611 0.624931C10.1512 0.624931 13.0012 3.47499 13.0012 7.00007C13.0012 10.5251 10.1512 13.3752 6.62611 13.3752ZM6.62611 1.37495C3.51354 1.37495 1.00099 3.8875 1.00099 7.00007C1.00099 10.1126 3.51354 12.6252 6.62611 12.6252C9.73868 12.6252 12.2512 10.1126 12.2512 7.00007C12.2512 3.8875 9.73868 1.37495 6.62611 1.37495Z" />
            <path d="M6.51378 10.6373L5.98877 10.1122L9.10134 6.99968L5.98877 3.88712L6.51378 3.36211L10.1514 6.99968L6.51378 10.6373Z" />
            <path d="M3.25098 6.6249H9.62611V7.37492H3.25098V6.6249Z" />
          </svg>
        </button>
      </div>
    </section>
  );
};

export default Section4;
